In [1]:
import numpy as np
import pandas as pd

In [2]:
file = "c:\\Users\\dan\\Documents\\Curso Data Science\\Datasets\\ufo.csv"
ufo = pd.read_csv(file)

In [7]:
ufo.tail()

              City Colors Reported Shape Reported State              Time
18236   Grant Park             NaN       TRIANGLE    IL  12/31/2000 23:00
18237  Spirit Lake             NaN           DISK    IA  12/31/2000 23:00
18238  Eagle River             NaN            NaN    WI  12/31/2000 23:45
18239  Eagle River             RED          LIGHT    WI  12/31/2000 23:45
18240         Ybor             NaN           OVAL    FL  12/31/2000 23:59

# O isnull() retorna um Dataframe boleano, onde True indica valor nulo e False valor preenchido

In [3]:
file = "c:\\Users\\dan\\Documents\\Curso Data Science\\Datasets\\nulos.csv"
nulos = pd.read_csv(file)

In [5]:
nulos.head()

   id   nome
0   1    NaN
1   2  Clara
2   3    NaN
3   4   Joao

In [4]:
nulos.isnull().tail()

      id   nome
0  False   True
1  False  False
2  False   True
3  False  False

In [6]:
ufo.isnull().tail()

        City  Colors Reported  Shape Reported  State   Time
18236  False             True           False  False  False
18237  False             True           False  False  False
18238  False             True            True  False  False
18239  False            False           False  False  False
18240  False             True           False  False  False

# Como saber a quantidade de valores nulos em uma coluna

In [8]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

# Construindo um filtro de valores nulos

In [11]:
ufo[ufo.City.isnull()]

      City Colors Reported Shape Reported State              Time
21     NaN             NaN            NaN    LA    8/15/1943 0:00
22     NaN             NaN          LIGHT    LA    8/15/1943 0:00
204    NaN             NaN           DISK    CA   7/15/1952 12:30
241    NaN            BLUE           DISK    MT    7/4/1953 14:00
613    NaN             NaN           DISK    NV    7/1/1960 12:00
1877   NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00
2013   NaN             NaN            NaN    NH     8/1/1970 9:30
2546   NaN             NaN       FIREBALL    OH  10/25/1973 23:30
3123   NaN             RED       TRIANGLE    WV  11/25/1975 23:00
4736   NaN             NaN         SPHERE    CA   6/23/1982 23:00
5269   NaN             NaN            NaN    AZ   6/30/1985 21:30
6735   NaN             NaN      FORMATION    TX     4/1/1992 2:00
7208   NaN             NaN         CIRCLE    MI   10/4/1993 17:30
8828   NaN             NaN       TRIANGLE    WA  10/30/1995 21:30
8967   NaN             NaN        VARIOUS    CA   12/8/1995 18:00
9273   NaN             NaN       TRIANGLE    OH     5/1/1996 3:00
9388   NaN             NaN           OVAL    CA   6/12/1996 12:00
9587   NaN             NaN            EGG    FL   8/24/1996 15:00
10399  NaN             NaN       TRIANGLE    IL   6/15/1997 23:00
11625  NaN             NaN         CIRCLE    TX     6/7/1998 7:00
12441  NaN             RED       FIREBALL    WA  10/26/1998 17:58
15767  NaN             NaN      RECTANGLE    NV   1/21/2000 11:30
15812  NaN             NaN          LIGHT    NV     2/2/2000 3:00
16054  NaN           GREEN            NaN    FL    3/11/2000 3:30
16608  NaN             NaN         SPHERE    NY   6/15/2000 15:00

In [20]:
ufo[ufo['Shape Reported'].isnull()].head()

           City Colors Reported Shape Reported State            Time
16  Los Angeles             NaN            NaN    CA  2/25/1942 0:00
17    Hapeville             NaN            NaN    GA  6/1/1942 22:30
21          NaN             NaN            NaN    LA  8/15/1943 0:00
53       Minden             NaN            NaN    LA   6/1/1947 0:00
56     Oroville             NaN            NaN    CA  6/1/1947 18:00

In [12]:
#Numero de linhas e colunas
A = ufo.shape
A

(18241, 5)

# dropna() 
 any - se qualquer valor estiver faltando na linha então o método apaga a linha inteira

In [14]:
B = ufo.dropna(how='any').shape
B

(2486, 5)

In [18]:
# O retorno do shape é uma tupla

print('Deletadas ' + str((A[0]-B[0])) + ' linhas com valores nulos')

Deletadas 15755 linhas com valores nulos

In [19]:
ufo.dropna(how='any').shape

(2486, 5)

In [20]:
ufo.shape

(18241, 5)

In [21]:
# Repetindo com o dataframe nulos
nulos.shape

(4, 2)

In [23]:
nulos.head()

   id   nome
0   1    NaN
1   2  Clara
2   3    NaN
3   4   Joao

In [24]:
nulos.dropna(how='any')

   id   nome
1   2  Clara
3   4   Joao

In [25]:
nulos.dropna(how='all')

   id   nome
0   1    NaN
1   2  Clara
2   3    NaN
3   4   Joao

# all - O all funciona da seguinte forma: Caso todos os valores de uma linah sejam nulo, ela será deletada

In [22]:
ufo.dropna(how='all').shape

(18241, 5)

# Utilizando o dropna com parâmetros

# O parametro subset recebe uma lista

In [27]:
#Estamos criando um subset com City e Shape Reported. Se houver qualquer valor nulo nessas colunas, a linah será deletada

ufo.dropna(subset=['City', 'Shape Reported'], how='any').shape

(15576, 5)

In [28]:
# Se todos os valores estiverem nulos em City ou SHape Reported, as linhas serão deletadas
ufo.dropna(subset=['City', 'Shape Reported'], how='all').shape

(18237, 5)

Como trabalhar com o parâmetro how()
    . O any funciona como um or ou |
    . O all funciona como um and ou &

# value_counts realiza um count porém não conta os valores NaN

In [26]:
ufo['Shape Reported'].value_counts().head()

LIGHT       2803
DISK        2122
TRIANGLE    1889
OTHER       1402
CIRCLE      1365
Name: Shape Reported, dtype: int64

In [28]:
#Podemos incluir o NaN
ufo['Shape Reported'].value_counts(dropna=False).head()

LIGHT       2803
NaN         2644
DISK        2122
TRIANGLE    1889
OTHER       1402
Name: Shape Reported, dtype: int64

In [29]:
#Podemos aidna preencher os valores que estão faltando 
ufo['Shape Reported'].fillna(value='DIVERSOS', inplace=True)

In [31]:
#confirmando a contagem incluindo o valor DIVERSOS
ufo['Shape Reported'].value_counts().head()

LIGHT       2803
DIVERSOS    2644
DISK        2122
TRIANGLE    1889
OTHER       1402
Name: Shape Reported, dtype: int64

# Excluindo valores nulos

In [33]:
arquivo = "c:\\Users\\dan\\Documents\\Curso Data Science\\Datasets\\sanduiches.txt"
vendas = pd.read_table(arquivo)
vendas.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [34]:
vendas.shape

(4622, 5)

In [35]:
# Apagando os valores as linahs com valores nulos em descrição

ordens = vendas.dropna(subset=['choice_description'], how='any')

In [36]:
ordens.shape

(3376, 5)

In [37]:
ordens.head(10)

,order_id,quantity,item_name,choice_description,item_price
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
11,6,1,Chicken Crispy Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
12,6,1,Chicken Soft Tacos,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$8.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25

In [39]:
#Contando qauntos pratos tem de Coke

ordens.choice_description.str.contains('Coke').sum()

257

In [40]:
#Contando quantos pratos tem de Guacamole

ordens.choice_description.str.contains('Guacamole').astype(int).sum()

1037

In [41]:
ordens.choice_description.str.contains('Rice').astype(int).sum()

2402